FSI/onewayFluid/Fluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0; //103500;

boundaryField
{
    interface
    {
        type zeroGradient; //type fixedFluxPressure;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type fixedValue;
        value uniform 0;
        //type totalPressure;
        //p0 $internalField;
        //value $internalField;
    }
    "(top|bottom)"
    {
        type zeroGradient; //type            fixedFluxPressure;
    }
    sides
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
