FSI/onewayFluid/Fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PBiCGStab;
        preconditioner  none;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(pcorr|pcorrFinal|pFinal)" { $p; relTol 0; }

    U
    {
        solver          PBiCGStab;
        preconditioner  none;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    UFinal { $U; relTol 0; }

    cellDisplacement
    {
        solver          PBiCGStab;
        //preconditioner TURDD;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    }

    cellDisplacementFinal
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;

    pRefCell            0;
    pRefValue           0;

}

/*
(
DIC
FDIC
GAMG
diagonal
none
)
*/
// ************************************************************************* //
