FSI/onewayFluid/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              Fluid-Mesh-Faces;
    patches           (interface);
    locations         faceCenters;
    
    readData ( );
    
    writeData ( Forces );
  };

  Interface2
  {
    mesh             Fluid-Mesh-Nodes;
    patches          (interface);
    locations        faceNodes;

    readData ( Displacements );

    writeData ( );    
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1100;
  namePointDisplacement pointDisplacement;
}

